
package Utils;

import java.awt.Dimension;
import java.awt.Toolkit;

import fighting.Status;

public class Global {
	// 測試用 (Debug模式下才有用)
	public static final boolean DEBUG = false;
	public static final boolean LINE = false;
	public static final boolean RAINING = false;
	public static final int STORY = 0;
	public static final boolean HAS_POTLID = true;
	public static final boolean HAS_CROSS = true;
	public static final int HAS_BOON = 10;

	// 鏡頭起始座標
	public static final int CAMERA_X = 0;
	public static final int CAMERA_Y = 0;
	
	// 主角起始座標
	public static final String CHICK_NAME = "我是一隻雞";
	public static final int CHICK_X = 1415;
	public static final int CHICK_Y = 1500;

	// 視窗大小
	public static final Dimension screensize = Toolkit.getDefaultToolkit().getScreenSize();
	public static final int SCREEN_WIDTH = (int) screensize.getWidth();
	public static final int SCREEN_HEIGHT = (int) screensize.getHeight();
	public static final int WINDOWS_WIDTH = 1000;
	public static final int WINDOWS_HEIGHT = 700;

	// 資料刷新時間
	public static final int UPDATE_TIMES_PER_SEC = 60;
	public static final int MILLISEC_PER_UPDATE = 1000 / UPDATE_TIMES_PER_SEC;

	// 畫面更新時間
	public static final int FRAME_LIMIT = 60;
	public static final int LIMIT_DELTA_TIME = 1000 / FRAME_LIMIT;

	// 物件速度計算
	public static final int ACT_SPEED = 120 / UPDATE_TIMES_PER_SEC;
	public static final int ANIMA_DELAY = UPDATE_TIMES_PER_SEC / 15;
	
	// DelayCounter設定
	public static final int DIALOGUE_DELAY = 100000;
	public static final int CHICK_DELAY = 1;
	public static final int PASSERS_DELAY = 5;

	// 上下左右常數制定
	public static final int UP = 3;
	public static final int LEFT = 1;
	public static final int DOWN = 0;
	public static final int RIGHT = 2;
	public static final int SPACE = -1;
	public static final int ESC = -2;
	public static final int ENTER = -3;
	
	// 主角大小制定
	public static final int CHICK_SIZE_X = 45;
	public static final int CHICK_SIZE_Y = 50;

	// 人物設定
	public static final int ACTOR_SIZE = 32;
	public static final int ACTOR_STEP = 3;
	public static final int ACTOR_SPEED = 3;
	
	// 主角+怪物卡
	public static final Status STATUS_CHICK = new Status(20000, 100000, 10000);
	public static final Status STATUS_VILLAGE_HEAD = new Status(1000, 500, 150);
	public static final Status STATUS_BIG_SLIME = new Status(100, 50, 30);
	public static final Status STATUS_SLIME = new Status(50, 25, 10);
	public static final Status STATUS_MOSTER = new Status(250, 125, 50);
	public static final Status STATUS_SOLDIER = new Status(500, 350, 100);
	public static final Status STATUS_PEOPLE = new Status(500, 250, 70);
	
    // 圖片大小制定
    public static final int IMG_X_OFFSET = 32;
    public static final int IMG_Y_OFFSET = 32;
    public static final int IMG_X_CHICKEN = 45;
    public static final int IMG_Y_CHICKEN = 50;

	// 人物狀態
	public static final int HEALTH = 1;
	public static final int WEAK = 2;
	
	// 場景地面圖片
	public static final int GROUND_SIZE = 64;
	public static final int GROUND_TURF = 0;
	public static final int GROUND_WATERPOOL_UNDER = 12;
	public static final int GROUND_FLOOR = 20;
	public static final int GROUND_FLOOR_SHADOW = 21;
	public static final int GROUND_BRIDGE = 16;

	// 場景物品圖片
	// 0 = null
	public static final int GROUND_TREE = 1;
	public static final int GROUND_ROAD = 2;	//石頭路、不做碰撞判斷(那要移到場景地面嗎?)
	public static final int GROUND_WATER = 3;
	public static final int GROUND_TURF_WALL = 5;
	public static final int GROUND_WATERFALL1 = 6;
	public static final int GROUND_WATERFALL2 = 7;
	public static final int GROUND_TURF_LADDER = 8;	//階梯、不做碰撞判斷(那要移到場景地面嗎?)
	public static final int GROUND_WATERPOOL = 10;
	public static final int GROUND_CHAIR = 22;
	public static final int GROUND_STATUE1 = 23;
	public static final int GROUND_FRUIT = 24;
	public static final int GROUND_GOODS = 25;
	public static final int GROUND_BOXES = 26;
	public static final int GROUND_STATUE2= 27;
	public static final int GROUND_EQUIPMENT1= 28;
	public static final int GROUND_EQUIPMENT2= 29;
	public static final int GROUND_EQUIPMENT3= 30;
	public static final int GROUND_BONE= 31;
	public static final int GROUND_PROP1= 32;
	public static final int GROUND_PROP2= 33;
	public static final int GROUND_PROP3= 34;
	public static final int GROUND_PROP4= 35;
	public static final int GROUND_GROSS= 36;
	public static final int GROUND_GRAVE= 37;
	public static final int GROUND_LIGHT= 45;
	public static final int GROUND_PAINO= 76;
		//之 劇情道具
	public static final int GROUND_KEY_INSLIME = 38;	
	public static final int GROUND_SHINING = 39;
	public static final int GROUND_WOOD = 74;
		
		//之 障礙物用途
	public static final int GROUND_OBSTACLE = -1;
	public static final int GROUND_OBSTACLE_CHURCH = -2;
	public static final int GROUND_OBSTACLE_EQUIPMENT = -3;
	public static final int GROUND_OBSTACLE_PROP = -4;
	public static final int GROUND_OBSTACLE_STORE = -5;
	public static final int GROUND_OBSTACLE_CENTER = -6;
	public static final int GROUND_OBSTACLE_HOME = -7;
	public static final int GROUND_OBSTACLE_MOUNTAIN = -8;
	public static final int GROUND_OBSTACLE_ENTRANCE = -9;
	
	// 場景覆蓋物圖片
	// 0 = null
	public static final int GROUND_SKYTREE = 13;
	public static final int GROUND_TENT = 14;
	public static final int GROUND_SHELF = 15;
	public static final int GROUND_HOUSE = 17;
	public static final int GROUND_FIRE = 46;
	public static final int GROUND_SMALL_FIRE = 77;
	public static final int GROUND_SEDIMENT = 78;
	
	//場景裝飾物
	public static final int GROUND_DOOR = 18;
	public static final int GROUND_LOTUS = 4;
	public static final int GROUND_LEAF = 11;
	public static final int GROUND_WINDOW = 19;
	public static final int GROUND_WALL_VINE = 9;
	public static final int GROUND_FLOWER = 75;
	
	// 主畫面圖片
	public static final int MENU_FIRE = 17;
		
	// 人物圖片
	public static final int BUTTERFLY = 47;
	public static final int SLIME = 58;
	public static final int MONSTER = 72;
	public static final int SOLDIER = 111;
	public static final int VILLAGE_HEAD = 118;
	public static final int CHILD = 70;
	
	// 村莊地圖
	public static final int [][] VILLAGE_GROUND_LOCATION = {
									//10			              //20                          //30                          //40
		{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
		{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
		{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
		{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
		{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // 5
		{ 0, 0, 0, 0, 0,12, 0, 0, 0, 0, 0,12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
		{ 0, 0, 0, 0, 0,12,12, 0, 0, 0,12,12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
		{ 0, 0, 0, 0, 0, 0,12,12, 0,12,12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
		{ 0, 0, 0, 0, 0, 0, 0,12, 0,12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
		{ 0, 0, 0, 0, 0, 0, 0,12,12,12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // 10
		{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
		{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
		{ 0, 0, 0, 0, 0, 0, 0,12,12,12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
		{ 0, 0, 0, 0, 0, 0, 0,12, 0,12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
		{ 0, 0, 0, 0, 0, 0, 0,12, 0,12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // 15
		{ 0, 0, 0, 0, 0, 0,12, 0, 0,12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
		{ 0, 0, 0, 0, 0, 0,12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
		{ 0, 0, 0, 0,12,12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
		{ 0, 0, 0,12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
		{ 0,12,12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,21,21,21, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // 20
		{12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,20,20,20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
		{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
		{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
		{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
		{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // 25
		{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
		{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
		{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
		{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
		{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },// 30
		};
	public static final int [][] VILLAGE_OBJECTS_LOCATION = {
									//10			              //20                          //30                          //40
		{ 5, 5, 5, 5, 5, 7, 6, 7, 6, 7, 6, 7, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,-8, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,	5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5 },
		{ 5, 5, 5, 5,10, 6, 7, 6, 7, 6, 7, 6,10, 5, 5, 5, 0, 0, 5, 5, 5, 5, 8, 5, 5, 5, 5, 0, 0, 0, 5, 5, 5, 5,	0,22, 0,27, 0,22, 0, 5, 5, 0, 1 },
		{ 0, 0, 5, 5,10,10,10,10,10,10,10,10,10, 5, 5, 0, 0, 0, 0, 0, 5, 5, 8, 5, 5, 0, 0, 0,31, 0, 0, 0, 5, 5, 5, 0, 0, 0, 0, 0, 5, 5, 0, 0, 1 },
		{ 0, 0, 0, 5, 5,10,10,10,10,10,10,10, 5, 5, 0, 0, 0,31, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,74,-1, 5, 8, 5, 8, 5, 0, 0, 0,-1, 1 },
		{ 0, 0, 0, 5, 5, 5, 5, 6, 7, 6, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,-1, 0,22, 0, 1 }, // 5
		{ 0, 0, 5, 5, 0,10, 5, 7, 6, 7, 5,10, 5, 0,-1, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1 },
		{ 5, 5, 5, 0, 0,10,10,10,10,10,10,10, 5, 0, 0, 0, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,	2, 2, 2, 2, 2, 0, 0, 0, 0, 5, 5 },
		{ 5, 0, 0, 0, 0, 0,10,10,10,10,10, 5, 5, 0, 0, 0, 2, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 2, 0, 0, 5, 5, 5 },
		{ 1, 0, 0, 0,-1, 0, 0,10,10,10, 5, 5, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 5, 5,74, 1 },
		{ 1, 0,31, 0, 0, 0, 0,10,10,10, 5, 0, 0, 0, 2, 0, 0, 0, 0, 1, 1, 0, 2, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 5, 8, 8, 5, 5, 0, 0, 1 }, // 10
		{ 1, 0, 0, 0, 0, 0, 0,16,16,16, 0, 0, 0, 2, 0, 0, 0, 0, 1, 5, 5, 8, 8, 8, 5, 5, 1, 0, 0,76, 0, 0, 0,-1,	0, 0, 5, 5, 8, 8, 5, 0, 0, 0, 1 },
		{ 1, 0, 0, 0, 0, 0, 0,16,16,16, 0, 0, 2, 0, 0, 0, 0, 0, 5, 5, 0, 0, 2, 0, 0, 5, 5, 0, 0, 0,22,22, 0, 0,	0, 5, 5, 0, 0, 0, 0, 0,-1, 0, 1 },
		{ 1, 0, 0, 0,31, 0, 0, 6, 7, 6, 0, 0, 0, 0, 0, 0, 0, 5, 5, 0, 0, 0, 2, 0, 0, 0, 5, 5, 0, 0, 0, 0, 0, 0, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 1 },
		{ 1, 0, 0, 0, 0, 0, 5, 7, 6, 7, 0, 0, 0, 0, 5, 8, 8, 5, 0, 0, 0, 0, 2, 0, 0, 1, 1, 5, 5, 0, 0, 0, 5, 5,	5, 0, 0,33, 0, 0,-1,-1,-1, 0, 1 },
		{ 1, 0, 0, 0, 0, 5, 5,10,10,10, 0, 0, 0, 5, 5, 8, 8,74, 0,-1, 0, 0, 2, 0, 0, 3, 1, 0, 5, 5, 5, 5, 5, 5,	0, 0,32,34, 0, 0,-1,-4,-1, 0, 1 }, // 15
		{ 1, 0,74,-1, 0, 5,10,10,10,10, 0,-1, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 5, 5, 5,	5, 0, 0,35, 0, 0, 0, 0,45, 0, 1 },
		{ 1, 0, 0, 5, 5, 5,10,10,10, 5, 5, 5, 5, 0, 0, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 0, 0, 0, 0,	5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 5 },
		{ 1, 0, 5, 5,10,10,10,10,10, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 2, 0,-1, 0, 0,	0, 5, 5, 5, 0, 0, 0, 0, 5, 5, 5 },
		{ 5, 5, 5,10,10,10,10,10, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 5, 5, 8, 8, 5, 5, 0, 1 },
		{ 5,10,10,10,10,10,10, 5, 5, 0, 0, 0, 0, 1, 1, 0,-1,-1,-1,-1, 1, 0, 2, 0, 1, 0, 0, 0, 0, 0, 0, 0,-1,-1,-1,-1, 1,74, 0, 0, 0, 0, 0, 0, 1 }, // 20
		{10,10,10,10,10, 5, 5, 5, 0, 0, 0, 0, 0,22,22, 0,-1,-6,-6,-1, 1, 0, 2, 0, 1,-1, 0,-1, 0,22,22, 0,-1,-7,-7,-1, 1, 0, 0, 0, 0, 0, 3, 0, 1 },
		{10,10,10,10,10, 5, 5, 0, 0,-1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 1 },
		{10,10,10,10, 5, 5, 0, 0, 0, 0, 0, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,	2, 2, 2, 2, 2, 0, 0, 0, 0, 0, 1 },
		{10,10, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1 },
		{10,10, 5, 5, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 2, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0,	0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1 }, // 25
		{10, 5, 5, 0, 0, 0, 0, 0, 0, 0,26,-1,-1,-1,-1,25, 0, 0, 1,23, 0, 0, 2, 0, 0,23, 1, 0,-1,-1,-1,-1,30, 0,	0, 1, 0,37,-1,-1,-1,-1,37, 0, 1 },
		{ 5, 5, 0, 0,-1, 0, 0, 0, 0,24,24,-1,-5,-5,-1,24,24, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0,-1,-3,-3,-1,29,28,	0, 1, 0,36,-1,-2,-2,-1,36, 0, 1 },
		{ 5, 0, 0,74, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1 },
		{ 1, 0, 0, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,	2, 2, 2, 2, 2, 2, 2, 0, 0, 0, 1 },
		{ 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,-9,-9,-9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,	1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 }, // 30
		};
	public static final int [][] VILLAGE_COVER_LOCATION = {
									//10			             //20                          //30                          //40
		{13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
		{13,13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,13,	0, 0, 0, 0, 0, 0, 0, 0,13, 0,77 },
		{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,13, 0, 0, 0, 0,77 },
		{13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0,77 },
		{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0,77 }, // 5
		{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0,77 },
		{ 0, 0, 0,13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
		{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
		{77, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,13, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0,77 },
		{77, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,77,77, 0, 0, 0,77,77, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0,13, 0, 0,77 }, // 10
		{77, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,77, 0, 0, 0, 0, 0, 0, 0,77, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0,77 },
		{77, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,77 },
		{77, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0,14, 0, 0, 0,77 },
		{77, 0,13, 0, 0, 0, 0, 0, 0, 0,13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,77,77, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0,46, 0, 0, 0,77 },
		{77, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,77, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0,77 }, // 15
		{77, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,13, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0,77 },
		{77, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,17, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
		{77, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
		{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,15, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0,77 },
		{ 0, 0, 0, 0, 0, 0, 0, 0,13, 0, 0, 0, 0,77,77, 0,46,46, 0, 0,77, 0, 0, 0,77, 0, 0, 0, 0, 0, 0, 0,46,46,	0, 0,77, 0, 0, 0, 0, 0, 0, 0,77 }, // 20
		{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,77, 0, 0, 0,77, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0,77, 0, 0, 0, 0, 0, 0, 0,77 },
		{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0,77 },
		{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,17, 0, 0, 0, 0, 0,	0, 0, 0, 0,17, 0, 0, 0, 0, 0,77 },
		{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0,77 },
		{ 0, 0, 0,13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,77,77, 0, 0, 0, 0, 0,77,77, 0, 0, 0, 0, 0, 0, 0,	0,77, 0, 0, 0, 0, 0, 0, 0, 0,77 }, // 25
		{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,46,46, 0, 0, 0, 0, 0,77, 0, 0, 0, 0, 0, 0, 0,77, 0,46,46, 0, 0, 0, 0,	0,77, 0, 0,46,46, 0, 0, 0, 0,77 },
		{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0,77, 0, 0, 0, 0, 0, 0, 0, 0,77 },
		{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0,77 },
		{77, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,	0, 0, 0, 0, 0, 0, 0, 0, 0, 0,77 },
		{77,77,77,77,77,77,77,77,77,77,77,77,77,77,77,77,77,77,77,77,77, 0, 0, 0,77,77,77,77,77,77,77,77,77,77,77,77,77,77,77,77,77,77,77,77,77 },// 30
		};
		
}
